dvdfreitag/ocarina/CMSIS/devices/same70q21/include/component/usbhs.h
/* -------- USBHS_HSTCTRL : (USBHS Offset: 0x400) (R/W 32) Host General Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t SOFE:1;                    /**< bit:      8  Start of Frame Generation Enable         */
    uint32_t RESET:1;                   /**< bit:      9  Send USB Reset                           */
    uint32_t RESUME:1;                  /**< bit:     10  Send USB Resume                          */
    uint32_t :1;                        /**< bit:     11  Reserved */
    uint32_t SPDCONF:2;                 /**< bit: 12..13  Mode Configuration                       */
    uint32_t :18;                       /**< bit: 14..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTCTRL_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define USBHS_HSTCTRL_OFFSET                (0x400)                                       /**<  (USBHS_HSTCTRL) Host General Control Register  Offset */

#define USBHS_HSTCTRL_SOFE_Pos              8                                              /**< (USBHS_HSTCTRL) Start of Frame Generation Enable Position */
#define USBHS_HSTCTRL_SOFE_Msk              (_U_(0x1) << USBHS_HSTCTRL_SOFE_Pos)           /**< (USBHS_HSTCTRL) Start of Frame Generation Enable Mask */
#define USBHS_HSTCTRL_SOFE                  USBHS_HSTCTRL_SOFE_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTCTRL_SOFE_Msk instead */
#define USBHS_HSTCTRL_RESET_Pos             9                                              /**< (USBHS_HSTCTRL) Send USB Reset Position */
#define USBHS_HSTCTRL_RESET_Msk             (_U_(0x1) << USBHS_HSTCTRL_RESET_Pos)          /**< (USBHS_HSTCTRL) Send USB Reset Mask */
#define USBHS_HSTCTRL_RESET                 USBHS_HSTCTRL_RESET_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTCTRL_RESET_Msk instead */
#define USBHS_HSTCTRL_RESUME_Pos            10                                             /**< (USBHS_HSTCTRL) Send USB Resume Position */
#define USBHS_HSTCTRL_RESUME_Msk            (_U_(0x1) << USBHS_HSTCTRL_RESUME_Pos)         /**< (USBHS_HSTCTRL) Send USB Resume Mask */
#define USBHS_HSTCTRL_RESUME                USBHS_HSTCTRL_RESUME_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use USBHS_HSTCTRL_RESUME_Msk instead */
#define USBHS_HSTCTRL_SPDCONF_Pos           12                                             /**< (USBHS_HSTCTRL) Mode Configuration Position */
#define USBHS_HSTCTRL_SPDCONF_Msk           (_U_(0x3) << USBHS_HSTCTRL_SPDCONF_Pos)        /**< (USBHS_HSTCTRL) Mode Configuration Mask */
#define USBHS_HSTCTRL_SPDCONF(value)        (USBHS_HSTCTRL_SPDCONF_Msk & ((value) << USBHS_HSTCTRL_SPDCONF_Pos))
#define   USBHS_HSTCTRL_SPDCONF_NORMAL_Val  _U_(0x0)                                       /**< (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable.  */
#define   USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val _U_(0x1)                                       /**< (USBHS_HSTCTRL) For a better consumption, if high speed is not needed.  */
#define USBHS_HSTCTRL_SPDCONF_NORMAL        (USBHS_HSTCTRL_SPDCONF_NORMAL_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable. Position  */
#define USBHS_HSTCTRL_SPDCONF_LOW_POWER     (USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val << USBHS_HSTCTRL_SPDCONF_Pos)  /**< (USBHS_HSTCTRL) For a better consumption, if high speed is not needed. Position  */
#define USBHS_HSTCTRL_MASK                  _U_(0x3700)                                    /**< \deprecated (USBHS_HSTCTRL) Register MASK  (Use USBHS_HSTCTRL_Msk instead)  */
#define USBHS_HSTCTRL_Msk                   _U_(0x3700)                                    /**< (USBHS_HSTCTRL) Register Mask  */


/* -------- USBHS_HSTISR : (USBHS Offset: 0x404) (R/ 32) Host Global Interrupt Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DCONNI:1;                  /**< bit:      0  Device Connection Interrupt              */
    uint32_t DDISCI:1;                  /**< bit:      1  Device Disconnection Interrupt           */
    uint32_t RSTI:1;                    /**< bit:      2  USB Reset Sent Interrupt                 */
    uint32_t RSMEDI:1;                  /**< bit:      3  Downstream Resume Sent Interrupt         */
    uint32_t RXRSMI:1;                  /**< bit:      4  Upstream Resume Received Interrupt       */
    uint32_t HSOFI:1;                   /**< bit:      5  Host Start of Frame Interrupt            */
    uint32_t HWUPI:1;                   /**< bit:      6  Host Wake-Up Interrupt                   */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t PEP_0:1;                   /**< bit:      8  Pipe 0 Interrupt                         */
    uint32_t PEP_1:1;                   /**< bit:      9  Pipe 1 Interrupt                         */
    uint32_t PEP_2:1;                   /**< bit:     10  Pipe 2 Interrupt                         */
    uint32_t PEP_3:1;                   /**< bit:     11  Pipe 3 Interrupt                         */
    uint32_t PEP_4:1;                   /**< bit:     12  Pipe 4 Interrupt                         */
    uint32_t PEP_5:1;                   /**< bit:     13  Pipe 5 Interrupt                         */
    uint32_t PEP_6:1;                   /**< bit:     14  Pipe 6 Interrupt                         */
    uint32_t PEP_7:1;                   /**< bit:     15  Pipe 7 Interrupt                         */
    uint32_t PEP_8:1;                   /**< bit:     16  Pipe 8 Interrupt                         */
    uint32_t PEP_9:1;                   /**< bit:     17  Pipe 9 Interrupt                         */
    uint32_t PEP_10:1;                  /**< bit:     18  Pipe 10 Interrupt                        */
    uint32_t PEP_11:1;                  /**< bit:     19  Pipe 11 Interrupt                        */
    uint32_t :5;                        /**< bit: 20..24  Reserved */
    uint32_t DMA_1:1;                   /**< bit:     25  DMA Channel 1 Interrupt                  */
    uint32_t DMA_2:1;                   /**< bit:     26  DMA Channel 2 Interrupt                  */
    uint32_t DMA_3:1;                   /**< bit:     27  DMA Channel 3 Interrupt                  */
    uint32_t DMA_4:1;                   /**< bit:     28  DMA Channel 4 Interrupt                  */
    uint32_t DMA_5:1;                   /**< bit:     29  DMA Channel 5 Interrupt                  */
    uint32_t DMA_6:1;                   /**< bit:     30  DMA Channel 6 Interrupt                  */
    uint32_t DMA_7:1;                   /**< bit:     31  DMA Channel 7 Interrupt                  */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t PEP_:12;                   /**< bit:  8..19  Pipe x Interrupt                         */
    uint32_t :5;                        /**< bit: 20..24  Reserved */
    uint32_t DMA_:7;                    /**< bit: 25..31  DMA Channel 7 Interrupt                  */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} USBHS_HSTISR_Type;
